driver-tests/filebc/JavaEE_vs_BC/FileOneWayIn_JBI/test/2soap2ejb2file/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://j2ee.netbeans.org/wsdl/SoapFeeder4FileOneWayIn" xmlns:sim="http://xml.netbeans.org/schema/SimpleSchema">
  <soapenv:Body>
    <soap:SoapFeeder4FileOneWayInOperation>
      <part1>
        <sim:requestElement>test data for testcase "2soap2ejb2file"</sim:requestElement>
      </part1>
    </soap:SoapFeeder4FileOneWayInOperation>
  </soapenv:Body>
</soapenv:Envelope>